// ownCloud

"_bad_username_password_"               = "Väärä käyttäjätunnus tai salasana";
"_cancelled_by_user"                    = "Siirto peruttu";
"_error_folder_destiny_is_the_same_"    = "Ei ole mahdollista siirtää kansiota samaan kansioon";
"_error_not_permission_"                = "Sinulla ei ole oikeuksia toteuttaa tätä toimintoa";
"_error_path_"                          = "Tiedoston tai kansion avaaminen epäonnistui. Varmista, että se on olemassa";
"_file_upload_not_exitst_"              = "The file that we want to upload does not exist";
"_forbidden_characters_from_server_"    = "The name contains at least one invalid character";
"_not_connected_internet_"              = "Server connection error";
"_not_possible_connect_to_server_"      = "It is not possible to connect to the server at this time";
"_not_possible_create_folder_"          = "Folder could not be created";
"_server_down_"                         = "The server is unreachable";
"_time_out_"                            = "Timeout, try again";
"_unknow_response_server_"              = "Unexpected response from server";
"_user_autentication_required_"         = "User autentication required";
"_file_directory_locked_"               = "Tiedosto tai hakemisto on lukittu";
"_ssl_certificate_untrusted_"           = "Palvelimen sertifikaatti on virheellinen";
"_internal_server_"                     = "Sisäinen palvelinvirhe";

"_file_already_exists_"                 = "Unable to complete the operation, there is a file with the same name";
"_file_folder_not_exists_"              = "The source file wasn't found at the specified path";
"_folder_contents_nochanged_"           = "The folder contents have not changed";
"_images_invalid_converted_"            = "The image is invalid and cannot be converted to a thumbnail";
"_method_not_expected_"                 = "Request method not expected";
"_reauthenticate_user_"                 = "Pääsy vanhentunut, käyttäjän tiedot päivitettävä";
"_server_error_retry_"                  = "Error server, retry the request";
"_too_many_files_"                      = "Too many files would be involved in the operation for it to complete successfully";
"_too_many_request_"                    = "Too many request and is being rate limited";
"_user_over_quota_"                     = "Levytila saavutettu";

"_ssl_connection_error_"                = "Connection SSL error, try again";
